In [43]:
import re

import pandas as pd

from WeatherAPI import Weather
from config import PATH_DATASET

In [44]:
data = pd.read_csv(PATH_DATASET, sep=';')
data

          datesk          Item Name        Date price
0       20110101     Kashini greens  01.01.2011   NaN
1       20110101    Pineapple juice  01.01.2011   NaN
2       20110101      Thiland Juice  01.01.2011   NaN
3       20110101      Thiland Jelly  01.01.2011   NaN
4       20110101       Orange juice  01.01.2011   NaN
...          ...                ...         ...   ...
868960  20180227       Komark fruit  27/02/2018    28
868961  20180227          Dry dates  27/02/2018    20
868962  20180227  Tamarind seedless  27/02/2018   230
868963  20180227    Dry fruit mixed  27/02/2018   NaN
868964  20180227  Tender Coconut(S)  27/02/2018    25

[868965 rows x 4 columns]

In [45]:
data.isna().sum()

datesk            0
Item Name      7839
Date              0
price        317017
dtype: int64

In [46]:
data = data[data['Item Name'].isna() == False]
data

          datesk          Item Name        Date price
0       20110101     Kashini greens  01.01.2011   NaN
1       20110101    Pineapple juice  01.01.2011   NaN
2       20110101      Thiland Juice  01.01.2011   NaN
3       20110101      Thiland Jelly  01.01.2011   NaN
4       20110101       Orange juice  01.01.2011   NaN
...          ...                ...         ...   ...
868960  20180227       Komark fruit  27/02/2018    28
868961  20180227          Dry dates  27/02/2018    20
868962  20180227  Tamarind seedless  27/02/2018   230
868963  20180227    Dry fruit mixed  27/02/2018   NaN
868964  20180227  Tender Coconut(S)  27/02/2018    25

[861126 rows x 4 columns]

In [47]:
data.isna().sum()

datesk            0
Item Name         0
Date              0
price        309178
dtype: int64

In [48]:
data = data[data['price'].isna() == False]
data

          datesk              Item Name        Date price
296     20110101           Sponge Gourd  01.01.2011    32
22311   20110309      Berry Southafrica  03.09.2011     0
22312   20110309      Baby corn cleaned  03.09.2011    56
22313   20110309              Baby corn  03.09.2011    14
22314   20110309  Chillies Bajji yagani  03.09.2011     0
...          ...                    ...         ...   ...
868958  20180227           Cherry fruit  27/02/2018   150
868960  20180227           Komark fruit  27/02/2018    28
868961  20180227              Dry dates  27/02/2018    20
868962  20180227      Tamarind seedless  27/02/2018   230
868964  20180227      Tender Coconut(S)  27/02/2018    25

[551948 rows x 4 columns]

In [49]:
data.isna().sum()

datesk       0
Item Name    0
Date         0
price        0
dtype: int64

In [50]:
print(data.Date.iloc[0])

01.01.2011

In [51]:
d = re.search(pattern=r'(?P<day>\d{2}).(?P<month>\d{2}).(?P<year>\d{4})', string=data.Date.iloc[0])
print('{year}-{month}-{day}'.format(year=d.groupdict()['year'], month=d.groupdict()['month'], day=d.groupdict()['day']))

2011-01-01

In [ ]:
def map_fuction_date_prcossing(x):
    d = re.search(pattern=r'(?P<day>\d{2}).(?P<month>\d{2}).(?P<year>\d{4})', string=x)
    return '{year}-{month}-{day}'.format(year=d.groupdict()['year'], month=d.groupdict()['month'], day=d.groupdict()['day'])

data.Date = data.Date.map(map_fuction_date_prcossing)

In [55]:
data.isna().sum()

datesk       0
Item Name    0
Date         0
price        0
dtype: int64

In [56]:
data

          datesk              Item Name        Date price
296     20110101           Sponge Gourd  2011-01-01    32
22311   20110309      Berry Southafrica  2011-09-03     0
22312   20110309      Baby corn cleaned  2011-09-03    56
22313   20110309              Baby corn  2011-09-03    14
22314   20110309  Chillies Bajji yagani  2011-09-03     0
...          ...                    ...         ...   ...
868958  20180227           Cherry fruit  2018-02-27   150
868960  20180227           Komark fruit  2018-02-27    28
868961  20180227              Dry dates  2018-02-27    20
868962  20180227      Tamarind seedless  2018-02-27   230
868964  20180227      Tender Coconut(S)  2018-02-27    25

[551948 rows x 4 columns]

In [57]:
data.to_csv(PATH_DATASET)